Ran Plan for project: `apps` dir: `terragrunt-integration/terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
>>>> PLANNING CHANGES <<<<

/home/atlantis/.atlantis/repos/jefersonlemos/atlantis-playground/25/default/terragrunt-integration/terraform

20:52:54.783 WARN   The `TERRAGRUNT_TFPATH` environment variable is deprecated and will be removed in a future version of Terragrunt. Use `TG_TF_PATH=terraform1.11.4` instead.
20:52:54.789 INFO   The runner at . will be processed in the following order for command plan:
Group 1
- Unit .
- Unit ./modules/random

Group 2
- Unit ./app1
- Unit ./app2


20:52:54.847 INFO   Downloading Terraform configurations from ./modules/random into ./.terragrunt-cache/AFhqy88-GgepsWaU7bktFuKYS98/ucpIR4vBHS23Mk_Z6sEJ2RKrzqY
20:52:54.870 INFO   [modules/random] terraform1.11.4: Initializing the backend...
20:52:54.870 INFO   terraform1.11.4: Initializing the backend...
20:52:54.870 INFO   [modules/random] terraform1.11.4: Initializing provider plugins...
20:52:54.870 INFO   [modules/random] terraform1.11.4: - Finding latest version of hashicorp/random...
20:52:54.871 INFO   terraform1.11.4: Initializing provider plugins...
20:52:54.871 INFO   terraform1.11.4: - Finding latest version of hashicorp/random...
20:52:55.083 INFO   terraform1.11.4: - Installing hashicorp/random v3.7.2...
20:52:55.087 INFO   [modules/random] terraform1.11.4: - Installing hashicorp/random v3.7.2...
20:52:56.300 INFO   terraform1.11.4: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
20:52:56.300 INFO   terraform1.11.4: Terraform has created a lock file .terraform.lock.hcl to record the provider
20:52:56.300 INFO   terraform1.11.4: selections it made above. Include this file in your version control repository
20:52:56.300 INFO   terraform1.11.4: so that Terraform can guarantee to make the same selections by default when
20:52:56.300 INFO   terraform1.11.4: you run "terraform init" in the future.
20:52:56.300 INFO   terraform1.11.4: Terraform has been successfully initialized!
20:52:56.442 STDOUT terraform1.11.4: Terraform used the selected providers to generate the following execution
20:52:56.442 STDOUT terraform1.11.4: plan. Resource actions are indicated with the following symbols:
20:52:56.442 STDOUT terraform1.11.4:   + create
20:52:56.442 STDOUT terraform1.11.4: Terraform will perform the following actions:
20:52:56.442 STDOUT terraform1.11.4:   # random_string.base_bucket_name will be created
20:52:56.443 STDOUT terraform1.11.4:   + resource "random_string" "base_bucket_name" {
20:52:56.443 STDOUT terraform1.11.4:       + id          = (known after apply)
20:52:56.443 STDOUT terraform1.11.4:       + length      = 4
20:52:56.443 STDOUT terraform1.11.4:       + lower       = true
20:52:56.443 STDOUT terraform1.11.4:       + min_lower   = 0
20:52:56.443 STDOUT terraform1.11.4:       + min_numeric = 0
20:52:56.443 STDOUT terraform1.11.4:       + min_special = 0
20:52:56.443 STDOUT terraform1.11.4:       + min_upper   = 0
20:52:56.443 STDOUT terraform1.11.4:       + number      = false
20:52:56.443 STDOUT terraform1.11.4:       + numeric     = false
20:52:56.443 STDOUT terraform1.11.4:       + result      = (known after apply)
20:52:56.443 STDOUT terraform1.11.4:       + special     = false
20:52:56.443 STDOUT terraform1.11.4:       + upper       = true
20:52:56.443 STDOUT terraform1.11.4:     }
20:52:56.443 STDOUT terraform1.11.4: Plan: 1 to add, 0 to change, 0 to destroy.
20:52:56.443 STDOUT terraform1.11.4: 
20:52:56.443 STDOUT terraform1.11.4: Changes to Outputs:
20:52:56.443 STDOUT terraform1.11.4:   + base_bucket_name = (known after apply)
20:52:56.493 WARN   [app2] Config ./commons.hcl is a dependency of ./app2/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
20:52:56.493 WARN   [app1] Config ./commons.hcl is a dependency of ./app1/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
20:52:56.494 INFO   [app2] Downloading Terraform configurations from ./modules/s3-bucket into ./app2/.terragrunt-cache/zzcz-Tr6GrdCUq9Hq19O5c5X-2s/gbThO4ZiNUt-131WPgDdf99WEQA
20:52:56.494 INFO   [app1] Downloading Terraform configurations from ./modules/s3-bucket into ./app1/.terragrunt-cache/FdBf2LvD_Zlvqi0XwQqfyRw0RxU/gbThO4ZiNUt-131WPgDdf99WEQA
20:52:56.523 INFO   [app2] terraform1.11.4: Initializing the backend...
20:52:56.524 INFO   [app2] terraform1.11.4: Initializing provider plugins...
20:52:56.524 INFO   [app2] terraform1.11.4: - Finding hashicorp/aws versions matching "~> 5.0"...
20:52:56.527 INFO   [app1] terraform1.11.4: Initializing the backend...
20:52:56.527 INFO   [app1] terraform1.11.4: Initializing provider plugins...
20:52:56.527 INFO   [app1] terraform1.11.4: - Finding hashicorp/aws versions matching "~> 5.0"...
20:52:56.594 INFO   [modules/random] terraform1.11.4: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
20:52:56.595 INFO   [modules/random] terraform1.11.4: Terraform has created a lock file .terraform.lock.hcl to record the provider
20:52:56.595 INFO   [modules/random] terraform1.11.4: selections it made above. Include this file in your version control repository
20:52:56.595 INFO   [modules/random] terraform1.11.4: so that Terraform can guarantee to make the same selections by default when
20:52:56.595 INFO   [modules/random] terraform1.11.4: you run "terraform init" in the future.
20:52:56.595 INFO   [modules/random] terraform1.11.4: Terraform has been successfully initialized!
20:52:56.689 INFO   [app2] terraform1.11.4: - Installing hashicorp/aws v5.100.0...
20:52:56.695 INFO   [app1] terraform1.11.4: - Installing hashicorp/aws v5.100.0...
20:52:56.733 STDOUT [modules/random] terraform1.11.4: Terraform used the selected providers to generate the following execution
20:52:56.733 STDOUT [modules/random] terraform1.11.4: plan. Resource actions are indicated with the following symbols:
20:52:56.733 STDOUT [modules/random] terraform1.11.4:   + create
20:52:56.733 STDOUT [modules/random] terraform1.11.4: Terraform will perform the following actions:
20:52:56.733 STDOUT [modules/random] terraform1.11.4:   # random_string.base_bucket_name will be created
20:52:56.733 STDOUT [modules/random] terraform1.11.4:   + resource "random_string" "base_bucket_name" {
20:52:56.733 STDOUT [modules/random] terraform1.11.4:       + id          = (known after apply)
20:52:56.733 STDOUT [modules/random] terraform1.11.4:       + length      = 4
20:52:56.733 STDOUT [modules/random] terraform1.11.4:       + lower       = true
20:52:56.733 STDOUT [modules/random] terraform1.11.4:       + min_lower   = 0
20:52:56.733 STDOUT [modules/random] terraform1.11.4:       + min_numeric = 0
20:52:56.733 STDOUT [modules/random] terraform1.11.4:       + min_special = 0
20:52:56.733 STDOUT [modules/random] terraform1.11.4:       + min_upper   = 0
20:52:56.733 STDOUT [modules/random] terraform1.11.4:       + number      = false
20:52:56.733 STDOUT [modules/random] terraform1.11.4:       + numeric     = false
20:52:56.733 STDOUT [modules/random] terraform1.11.4:       + result      = (known after apply)
20:52:56.733 STDOUT [modules/random] terraform1.11.4:       + special     = false
20:52:56.733 STDOUT [modules/random] terraform1.11.4:       + upper       = true
20:52:56.733 STDOUT [modules/random] terraform1.11.4:     }
20:52:56.733 STDOUT [modules/random] terraform1.11.4: Plan: 1 to add, 0 to change, 0 to destroy.
20:52:56.733 STDOUT [modules/random] terraform1.11.4: 
20:52:56.733 STDOUT [modules/random] terraform1.11.4: Changes to Outputs:
20:52:56.733 STDOUT [modules/random] terraform1.11.4:   + base_bucket_name = (known after apply)
20:54:20.553 INFO   [app1] terraform1.11.4: - Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
20:54:20.553 INFO   [app1] terraform1.11.4: Terraform has created a lock file .terraform.lock.hcl to record the provider
20:54:20.553 INFO   [app1] terraform1.11.4: selections it made above. Include this file in your version control repository
20:54:20.554 INFO   [app1] terraform1.11.4: so that Terraform can guarantee to make the same selections by default when
20:54:20.554 INFO   [app1] terraform1.11.4: you run "terraform init" in the future.
20:54:20.554 INFO   [app1] terraform1.11.4: Terraform has been successfully initialized!
20:54:23.276 INFO   [app2] terraform1.11.4: - Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
20:54:23.276 INFO   [app2] terraform1.11.4: Terraform has made some changes to the provider dependency selections recorded
20:54:23.276 INFO   [app2] terraform1.11.4: in the .terraform.lock.hcl file. Review those changes and commit them to your
20:54:23.276 INFO   [app2] terraform1.11.4: version control system if they represent changes you intended to make.
20:54:23.276 INFO   [app2] terraform1.11.4: Terraform has been successfully initialized!
20:54:24.388 STDOUT [app1] terraform1.11.4: Terraform used the selected providers to generate the following execution
20:54:24.388 STDOUT [app1] terraform1.11.4: plan. Resource actions are indicated with the following symbols:
20:54:24.388 STDOUT [app1] terraform1.11.4:   + create
20:54:24.388 STDOUT [app1] terraform1.11.4: Terraform will perform the following actions:
20:54:24.389 STDOUT [app1] terraform1.11.4:   # aws_s3_bucket.this will be created
20:54:24.389 STDOUT [app1] terraform1.11.4:   + resource "aws_s3_bucket" "this" {
20:54:24.389 STDOUT [app1] terraform1.11.4:       + acceleration_status         = (known after apply)
20:54:24.389 STDOUT [app1] terraform1.11.4:       + acl                         = "private"
20:54:24.389 STDOUT [app1] terraform1.11.4:       + arn                         = (known after apply)
20:54:24.389 STDOUT [app1] terraform1.11.4:       + bucket                      = "app1-new9-dev-base-name"
20:54:24.389 STDOUT [app1] terraform1.11.4:       + bucket_domain_name          = (known after apply)
20:54:24.389 STDOUT [app1] terraform1.11.4:       + bucket_prefix               = (known after apply)
20:54:24.389 STDOUT [app1] terraform1.11.4:       + bucket_regional_domain_name = (known after apply)
20:54:24.389 STDOUT [app1] terraform1.11.4:       + force_destroy               = false
20:54:24.390 STDOUT [app1] terraform1.11.4:       + hosted_zone_id              = (known after apply)
20:54:24.390 STDOUT [app1] terraform1.11.4:       + id                          = (known after apply)
20:54:24.390 STDOUT [app1] terraform1.11.4:       + object_lock_enabled         = (known after apply)
20:54:24.390 STDOUT [app1] terraform1.11.4:       + policy                      = (known after apply)
20:54:24.390 STDOUT [app1] terraform1.11.4:       + region                      = (known after apply)
20:54:24.390 STDOUT [app1] terraform1.11.4:       + request_payer               = (known after apply)
20:54:24.390 STDOUT [app1] terraform1.11.4:       + tags_all                    = (known after apply)
20:54:24.390 STDOUT [app1] terraform1.11.4:       + website_domain              = (known after apply)
20:54:24.390 STDOUT [app1] terraform1.11.4:       + website_endpoint            = (known after apply)
20:54:24.391 STDOUT [app1] terraform1.11.4:       + cors_rule (known after apply)
20:54:24.391 STDOUT [app1] terraform1.11.4:       + grant (known after apply)
20:54:24.391 STDOUT [app1] terraform1.11.4:       + lifecycle_rule (known after apply)
20:54:24.391 STDOUT [app1] terraform1.11.4:       + logging (known after apply)
20:54:24.391 STDOUT [app1] terraform1.11.4:       + object_lock_configuration (known after apply)
20:54:24.391 STDOUT [app1] terraform1.11.4:       + replication_configuration (known after apply)
20:54:24.391 STDOUT [app1] terraform1.11.4:       + server_side_encryption_configuration (known after apply)
20:54:24.391 STDOUT [app1] terraform1.11.4:       + versioning (known after apply)
20:54:24.391 STDOUT [app1] terraform1.11.4:       + website (known after apply)
20:54:24.391 STDOUT [app1] terraform1.11.4:     }
20:54:24.391 STDOUT [app1] terraform1.11.4: Plan: 1 to add, 0 to change, 0 to destroy.
20:54:24.391 STDOUT [app1] terraform1.11.4: 
20:54:24.391 STDOUT [app1] terraform1.11.4: Changes to Outputs:
20:54:24.391 STDOUT [app1] terraform1.11.4:   + bucket_arn = (known after apply)
20:54:24.391 STDOUT [app1] terraform1.11.4: ╷
20:54:24.391 STDOUT [app1] terraform1.11.4: │ Warning: Argument is deprecated
20:54:24.391 STDOUT [app1] terraform1.11.4: │ 
20:54:24.391 STDOUT [app1] terraform1.11.4: │   with aws_s3_bucket.this,
20:54:24.391 STDOUT [app1] terraform1.11.4: │   on bucket.tf line 17, in resource "aws_s3_bucket" "this":
20:54:24.391 STDOUT [app1] terraform1.11.4: │   17:   acl    = "private"
20:54:24.391 STDOUT [app1] terraform1.11.4: │ 
20:54:24.391 STDOUT [app1] terraform1.11.4: │ acl is deprecated. Use the aws_s3_bucket_acl resource instead.
20:54:24.392 STDOUT [app1] terraform1.11.4: │ 
20:54:24.392 STDOUT [app1] terraform1.11.4: │ (and one more similar warning elsewhere)
20:54:24.392 STDOUT [app1] terraform1.11.4: ╵
20:54:26.280 STDOUT [app2] terraform1.11.4: Terraform used the selected providers to generate the following execution
20:54:26.281 STDOUT [app2] terraform1.11.4: plan. Resource actions are indicated with the following symbols:
20:54:26.281 STDOUT [app2] terraform1.11.4:   + create
20:54:26.281 STDOUT [app2] terraform1.11.4: Terraform will perform the following actions:
20:54:26.281 STDOUT [app2] terraform1.11.4:   # aws_s3_bucket.this will be created
20:54:26.281 STDOUT [app2] terraform1.11.4:   + resource "aws_s3_bucket" "this" {
20:54:26.281 STDOUT [app2] terraform1.11.4:       + acceleration_status         = (known after apply)
20:54:26.281 STDOUT [app2] terraform1.11.4:       + acl                         = "private"
20:54:26.281 STDOUT [app2] terraform1.11.4:       + arn                         = (known after apply)
20:54:26.281 STDOUT [app2] terraform1.11.4:       + bucket                      = "app2-dev-base-name"
20:54:26.281 STDOUT [app2] terraform1.11.4:       + bucket_domain_name          = (known after apply)
20:54:26.281 STDOUT [app2] terraform1.11.4:       + bucket_prefix               = (known after apply)
20:54:26.281 STDOUT [app2] terraform1.11.4:       + bucket_regional_domain_name = (known after apply)
20:54:26.281 STDOUT [app2] terraform1.11.4:       + force_destroy               = false
20:54:26.281 STDOUT [app2] terraform1.11.4:       + hosted_zone_id              = (known after apply)
20:54:26.281 STDOUT [app2] terraform1.11.4:       + id                          = (known after apply)
20:54:26.281 STDOUT [app2] terraform1.11.4:       + object_lock_enabled         = (known after apply)
20:54:26.281 STDOUT [app2] terraform1.11.4:       + policy                      = (known after apply)
20:54:26.281 STDOUT [app2] terraform1.11.4:       + region                      = (known after apply)
20:54:26.281 STDOUT [app2] terraform1.11.4:       + request_payer               = (known after apply)
20:54:26.281 STDOUT [app2] terraform1.11.4:       + tags_all                    = (known after apply)
20:54:26.281 STDOUT [app2] terraform1.11.4:       + website_domain              = (known after apply)
20:54:26.281 STDOUT [app2] terraform1.11.4:       + website_endpoint            = (known after apply)
20:54:26.281 STDOUT [app2] terraform1.11.4:       + cors_rule (known after apply)
20:54:26.281 STDOUT [app2] terraform1.11.4:       + grant (known after apply)
20:54:26.281 STDOUT [app2] terraform1.11.4:       + lifecycle_rule (known after apply)
20:54:26.282 STDOUT [app2] terraform1.11.4:       + logging (known after apply)
20:54:26.282 STDOUT [app2] terraform1.11.4:       + object_lock_configuration (known after apply)
20:54:26.282 STDOUT [app2] terraform1.11.4:       + replication_configuration (known after apply)
20:54:26.282 STDOUT [app2] terraform1.11.4:       + server_side_encryption_configuration (known after apply)
20:54:26.282 STDOUT [app2] terraform1.11.4:       + versioning (known after apply)
20:54:26.282 STDOUT [app2] terraform1.11.4:       + website (known after apply)
20:54:26.282 STDOUT [app2] terraform1.11.4:     }
20:54:26.282 STDOUT [app2] terraform1.11.4: Plan: 1 to add, 0 to change, 0 to destroy.
20:54:26.282 STDOUT [app2] terraform1.11.4: 
20:54:26.282 STDOUT [app2] terraform1.11.4: Changes to Outputs:
20:54:26.282 STDOUT [app2] terraform1.11.4:   + bucket_arn = (known after apply)
20:54:26.282 STDOUT [app2] terraform1.11.4: ╷
20:54:26.282 STDOUT [app2] terraform1.11.4: │ Warning: Argument is deprecated
20:54:26.282 STDOUT [app2] terraform1.11.4: │ 
20:54:26.282 STDOUT [app2] terraform1.11.4: │   with aws_s3_bucket.this,
20:54:26.282 STDOUT [app2] terraform1.11.4: │   on bucket.tf line 17, in resource "aws_s3_bucket" "this":
20:54:26.282 STDOUT [app2] terraform1.11.4: │   17:   acl    = "private"
20:54:26.282 STDOUT [app2] terraform1.11.4: │ 
20:54:26.282 STDOUT [app2] terraform1.11.4: │ acl is deprecated. Use the aws_s3_bucket_acl resource instead.
20:54:26.282 STDOUT [app2] terraform1.11.4: │ 
20:54:26.282 STDOUT [app2] terraform1.11.4: │ (and one more similar warning elsewhere)
20:54:26.282 STDOUT [app2] terraform1.11.4: ╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p apps
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://6bfd250519e0.ngrok-free.app/lock?id=jefersonlemos%252Fatlantis-playground%252Fterragrunt-integration%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p apps
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```